Lingjia007/stm32f103c8t6_rtt-nano_znjj/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "adc.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
#include "rtthread.h"
#include "oled.h"
#include "esp8266_init.h"
#include "dht11.h"
#include "platform_mqtt.h"
#include "esp8266_config.h"
#include "light_sensor.h"
#include "mq2.h"
#include "pir_sensor.h"
#include "onenet_kv.h"
#include "onenet_cmd.h"
#include "relay.h"

#define DHT11_UPLOAD_ENABLED 1
#define DHT11_UPLOAD_INTERVAL 3600
#define DHT11_READ_RETRY 3
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
uint8_t t = ' ';

static rt_thread_t led_thread = RT_NULL;
static rt_thread_t oled_thread = RT_NULL;
static rt_thread_t dht11_thread = RT_NULL;
static rt_thread_t adc_sensor_thread = RT_NULL;
static rt_thread_t pir_sensor_thread = RT_NULL;
static rt_thread_t mqtt_recv_thread = RT_NULL;
static rt_thread_t mqtt_reply_thread = RT_NULL;

static rt_mutex_t g_esp8266_mutex = RT_NULL;
static rt_sem_t g_mqtt_frame_sem = RT_NULL;
static rt_mq_t g_mqtt_reply_mq = RT_NULL;

typedef struct
{
  char msg_id[32];
} mqtt_reply_msg_t;

static uint8_t g_mqtt_configured = 0;
static uint8_t g_mqtt_connected = 0;

static dht11_data_t g_dht11_data;
static uint8_t g_dht11_valid = 0;

onenet_kv_table_t g_kv_table;
onenet_cmd_ctx_t g_cmd_ctx;

static int g_kv_temperature = 0;
static int g_kv_humidity = 0;
static int g_kv_light = 0;
static int g_kv_mq2 = 0;
static uint8_t g_kv_bsp_led = 1;
static uint8_t g_kv_fan = 0;
static uint8_t g_kv_nebulizer = 0;
static char g_kv_pir[ONENET_KV_MAX_STRING_LEN] = "not_detected";
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */
static void dwt_init(void);
static int mqtt_reconnect(void);
static void onenet_kv_table_setup(void);
static void bsp_led_on_change(const char *key, void *value, uint8_t value_type);
static void fan_on_change(const char *key, void *value, uint8_t value_type);
static void nebulizer_on_change(const char *key, void *value, uint8_t value_type);
static void mqtt_frame_isr_cb(void *arg);
static void adc_sensor_thread_entry(void *parameter);
static void mqtt_recv_thread_entry(void *parameter);
static void mqtt_reply_thread_entry(void *parameter);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

static void bsp_led_on_change(const char *key, void *value, uint8_t value_type)
{
  uint8_t led_val = *((uint8_t *)value);
  rt_kprintf("BSP_LED changed -> %d (%s)\n", led_val, led_val ? "blink" : "off");
}

static void fan_on_change(const char *key, void *value, uint8_t value_type)
{
  uint8_t fan_val = *((uint8_t *)value);
  relay_fan_set(fan_val);
  rt_kprintf("FAN changed -> %d (%s)\n", fan_val, fan_val ? "ON" : "OFF");
}

static void nebulizer_on_change(const char *key, void *value, uint8_t value_type)
{
  uint8_t nebulizer_val = *((uint8_t *)value);
  relay_nebulizer_set(nebulizer_val);
  rt_kprintf("NEBULIZER changed -> %d (%s)\n", nebulizer_val, nebulizer_val ? "ON" : "OFF");
}

static void onenet_kv_table_setup(void)
{
  onenet_kv_init(&g_kv_table);

  onenet_kv_register(&g_kv_table, "TEMPERATURE",
                     PLATFORM_MQTT_VALUE_INT, &g_kv_temperature, NULL);
  onenet_kv_register(&g_kv_table, "HUMIDITY",
                     PLATFORM_MQTT_VALUE_INT, &g_kv_humidity, NULL);
  onenet_kv_register(&g_kv_table, "LIGHT",
                     PLATFORM_MQTT_VALUE_INT, &g_kv_light, NULL);
  onenet_kv_register(&g_kv_table, "MQ2",
                     PLATFORM_MQTT_VALUE_INT, &g_kv_mq2, NULL);
  onenet_kv_register(&g_kv_table, "BSP_LED",
                     PLATFORM_MQTT_VALUE_BOOL, &g_kv_bsp_led, bsp_led_on_change);
  onenet_kv_register(&g_kv_table, "FAN",
                     PLATFORM_MQTT_VALUE_BOOL, &g_kv_fan, fan_on_change);
  onenet_kv_register(&g_kv_table, "NEBULIZER",
                     PLATFORM_MQTT_VALUE_BOOL, &g_kv_nebulizer, nebulizer_on_change);
  onenet_kv_register(&g_kv_table, "PIR",
                     PLATFORM_MQTT_VALUE_STRING, g_kv_pir, NULL);

  onenet_cmd_init(&g_cmd_ctx, &g_kv_table,
                  &g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                  ONENET_PRODUCT_ID, ONENET_DEVICE_NAME);
}

static void led_thread_entry(void *parameter)
{
  while (1)
  {
    if (g_kv_bsp_led)
      HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);
    else
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
    rt_thread_mdelay(500);
  }
}

static void oled_thread_entry(void *parameter)
{
  while (1)
  {
    // OLED_ShowPicture(0, 0, 128, 64, BMP1, 1);
    OLED_Refresh();
    rt_thread_mdelay(500);

    OLED_Clear();
    OLED_ShowChinese(0, 0, 0, 16, 1);
    OLED_ShowChinese(18, 0, 1, 16, 1);
    OLED_ShowChinese(36, 0, 2, 16, 1);
    OLED_ShowChinese(54, 0, 3, 16, 1);
    OLED_ShowChinese(72, 0, 4, 16, 1);
    OLED_ShowChinese(90, 0, 5, 16, 1);
    OLED_ShowChinese(108, 0, 6, 16, 1);
    OLED_ShowString(8, 16, (uint8_t *)"ZHONGJINGYUAN", 16, 1);
    OLED_ShowString(20, 32, (uint8_t *)"2014/05/01", 16, 1);
    OLED_ShowString(0, 48, (uint8_t *)"ASCII:", 16, 1);
    OLED_ShowString(63, 48, (uint8_t *)"CODE:", 16, 1);
    OLED_ShowChar(48, 48, t, 16, 1);
    t++;
    if (t > '~')
      t = ' ';
    OLED_ShowNum(103, 48, t, 3, 16, 1);
    OLED_Refresh();
    rt_thread_mdelay(500);

    OLED_Clear();
    OLED_ShowChinese(0, 0, 0, 16, 1);
    OLED_ShowChinese(16, 0, 0, 24, 1);
    OLED_ShowChinese(24, 20, 0, 32, 1);
    OLED_ShowChinese(64, 0, 0, 64, 1);
    OLED_Refresh();
    rt_thread_mdelay(500);

    OLED_Clear();
    OLED_ShowString(0, 0, (uint8_t *)"ABC", 8, 1);
    OLED_ShowString(0, 8, (uint8_t *)"ABC", 12, 1);
    OLED_ShowString(0, 20, (uint8_t *)"ABC", 16, 1);
    OLED_Refresh();
    rt_thread_mdelay(500);
    // OLED_ScrollDisplay(11, 4, 1);
  }
}

static void dht11_thread_entry(void *parameter)
{
  rt_thread_mdelay(3000);
  while (1)
  {
    platform_mqtt_property_t props[2];
    dht11_data_t dht11_data;
    int prop_count = 0;
    int16_t ret;
    int dht11_ok = 0;
    int retry;

    for (retry = 0; retry < DHT11_READ_RETRY; retry++)
    {
      if (dht11_read(&dht11_data) == DHT11_OK)
      {
        dht11_ok = 1;
        break;
      }
      rt_kprintf("  DHT11 read retry %d/%d\n", retry + 1, DHT11_READ_RETRY);
      rt_thread_mdelay(200);
    }

