Lingjia007/stm32f103c8t6_rtt-nano_znjj/Core/Src/main.c
    memset(props, 0, sizeof(props));

    if (dht11_ok)
    {
      g_kv_temperature = dht11_data.temperature_int;
      g_kv_humidity = dht11_data.humidity_int;

      strncpy(props[0].key, "TEMPERATURE", sizeof(props[0].key) - 1);
      props[0].value_int = g_kv_temperature;
      props[0].value_type = PLATFORM_MQTT_VALUE_INT;

      strncpy(props[1].key, "HUMIDITY", sizeof(props[1].key) - 1);
      props[1].value_int = g_kv_humidity;
      props[1].value_type = PLATFORM_MQTT_VALUE_INT;

      prop_count = 2;
      rt_kprintf("  DHT11: Temp=%dC, Humi=%d%%\n",
                 g_kv_temperature, g_kv_humidity);
    }
    else
    {
      rt_kprintf("  DHT11 read failed after %d retries\n", DHT11_READ_RETRY);
    }

    if (!g_mqtt_connected)
    {
      mqtt_reconnect();
    }

    if (prop_count > 0 && g_mqtt_connected)
    {
      rt_mutex_take(g_esp8266_mutex, RT_WAITING_FOREVER);
      ret = MQTT_PUBLISH_PROPERTY(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                                  ONENET_PRODUCT_ID, ONENET_DEVICE_NAME,
                                  props, prop_count, "001");
      rt_mutex_release(g_esp8266_mutex);

      if (ret == PLATFORM_MQTT_OK)
        rt_kprintf("DHT11 Publish OK! (%d properties)\n", prop_count);
      else
        rt_kprintf("DHT11 Publish FAILED! (error=%d)\n", ret);
    }

    rt_thread_mdelay(DHT11_UPLOAD_INTERVAL);
  }
}

static void adc_sensor_thread_entry(void *parameter)
{
  uint16_t light_raw, mq2_raw;
  uint8_t light_percentage, mq2_percentage;
  platform_mqtt_property_t props[2];
  int16_t ret;

  rt_thread_mdelay(1000);
  light_sensor_init();
  mq2_init();

  while (1)
  {
    light_raw = light_sensor_read_raw();
    light_percentage = light_sensor_read_percentage();

    mq2_raw = mq2_read_raw();
    mq2_percentage = mq2_read_percentage();

    rt_kprintf("Light: Raw=%d, Pct=%d%% | MQ2: Raw=%d, Pct=%d%%\n",
               light_raw, light_percentage, mq2_raw, mq2_percentage);

    g_kv_light = light_percentage;
    g_kv_mq2 = mq2_percentage;

    if (!g_mqtt_connected)
    {
      mqtt_reconnect();
    }

    if (g_mqtt_connected)
    {
      memset(props, 0, sizeof(props));
      strncpy(props[0].key, "LIGHT", sizeof(props[0].key) - 1);
      props[0].value_int = g_kv_light;
      props[0].value_type = PLATFORM_MQTT_VALUE_INT;

      strncpy(props[1].key, "MQ2", sizeof(props[1].key) - 1);
      props[1].value_int = g_kv_mq2;
      props[1].value_type = PLATFORM_MQTT_VALUE_INT;

      rt_mutex_take(g_esp8266_mutex, RT_WAITING_FOREVER);
      ret = MQTT_PUBLISH_PROPERTY(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                                  ONENET_PRODUCT_ID, ONENET_DEVICE_NAME,
                                  props, 2, "002");
      rt_mutex_release(g_esp8266_mutex);

      if (ret == PLATFORM_MQTT_OK)
        rt_kprintf("ADC Sensors Publish OK!\n");
      else
        rt_kprintf("ADC Sensors Publish FAILED! (error=%d)\n", ret);
    }

    rt_thread_mdelay(5000);
  }
}

static void pir_sensor_thread_entry(void *parameter)
{
  uint8_t pir_status;
  platform_mqtt_property_t prop;
  int16_t ret;

  rt_thread_mdelay(1500);
  pir_sensor_init();

  while (1)
  {
    pir_status = pir_sensor_read();

    if (pir_status == PIR_DETECTED)
    {
      rt_kprintf("PIR Sensor: Detected! (Someone is here)\n");
      strncpy(g_kv_pir, "detected", sizeof(g_kv_pir) - 1);
    }
    else
    {
      rt_kprintf("PIR Sensor: Not detected (No one)\n");
      strncpy(g_kv_pir, "not_detected", sizeof(g_kv_pir) - 1);
    }

    if (!g_mqtt_connected)
    {
      mqtt_reconnect();
    }

    if (g_mqtt_connected)
    {
      memset(&prop, 0, sizeof(prop));
      strncpy(prop.key, "PIR", sizeof(prop.key) - 1);
      strncpy(prop.id, g_kv_pir, sizeof(prop.id) - 1);
      prop.value_type = PLATFORM_MQTT_VALUE_STRING;

      rt_mutex_take(g_esp8266_mutex, RT_WAITING_FOREVER);
      ret = MQTT_PUBLISH_PROPERTY(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                                  ONENET_PRODUCT_ID, ONENET_DEVICE_NAME,
                                  &prop, 1, "003");
      rt_mutex_release(g_esp8266_mutex);

      if (ret == PLATFORM_MQTT_OK)
        rt_kprintf("PIR Publish OK!\n");
      else
        rt_kprintf("PIR Publish FAILED! (error=%d)\n", ret);
    }

    rt_thread_mdelay(3000);
  }
}

static void mqtt_frame_isr_cb(void *arg)
{
  (void)arg;
  rt_sem_release(g_mqtt_frame_sem);
}

static void mqtt_recv_thread_entry(void *parameter)
{
  static char recv_topic[PLATFORM_MQTT_MAX_TOPIC_LEN];
  static char recv_payload[PLATFORM_MQTT_MAX_PAYLOAD_LEN];
  static char recv_msg_id[32];

  rt_thread_mdelay(4000);
  wifi_esp8266_set_frame_cb(g_esp8266_mqtt.wifi, mqtt_frame_isr_cb, NULL);
  rt_kprintf("[mqtt_recv] ISR-driven listening started\n");

  while (1)
  {
    rt_sem_take(g_mqtt_frame_sem, RT_WAITING_FOREVER);

    if (!g_mqtt_connected)
      continue;

    if (g_esp8266_mqtt.wifi->rx_frame.sta.finsh == 0)
      continue;

    memset(recv_topic, 0, sizeof(recv_topic));
    memset(recv_payload, 0, sizeof(recv_payload));
    memset(recv_msg_id, 0, sizeof(recv_msg_id));

    rt_mutex_take(g_esp8266_mutex, RT_WAITING_FOREVER);
    int16_t recv_ret = MQTT_CHECK_PROPERTY_SET_RECV(&g_esp8266_mqtt.base,
                                                    recv_topic, recv_payload,
                                                    sizeof(recv_payload), recv_msg_id);
    wifi_esp8266_rx_restart(g_esp8266_mqtt.wifi);
    rt_mutex_release(g_esp8266_mutex);

    if (recv_ret != PLATFORM_MQTT_OK)
      continue;

    if (strcmp(recv_topic, ONENET_TOPIC_PROPERTY_POST_REPLY) == 0)
      continue;

    rt_kprintf("[mqtt_recv] topic=%s\n", recv_topic);
    rt_kprintf("[mqtt_recv] payload=%s\n", recv_payload);

    if (strcmp(recv_topic, ONENET_TOPIC_PROPERTY_SET) == 0)
    {
      int8_t updated = onenet_kv_parse_set_payload(&g_kv_table, recv_payload);
      rt_kprintf("[mqtt_recv] SET: %d updated, LED=%d, T=%d, H=%d, L=%d, MQ2=%d\n",
                 updated, g_kv_bsp_led, g_kv_temperature, g_kv_humidity, g_kv_light, g_kv_mq2);

      mqtt_reply_msg_t reply;
      memset(&reply, 0, sizeof(reply));
      strncpy(reply.msg_id, recv_msg_id, sizeof(reply.msg_id) - 1);
      rt_mq_send(g_mqtt_reply_mq, &reply, sizeof(reply));
    }
    else if (strcmp(recv_topic, ONENET_TOPIC_PROPERTY_GET) == 0)
    {
      rt_kprintf("[mqtt_recv] GET request\n");
    }
    else if (strcmp(recv_topic, ONENET_TOPIC_OTA_INFORM) == 0)
    {
      rt_kprintf("[mqtt_recv] OTA inform\n");
    }
  }
}

static void mqtt_reply_thread_entry(void *parameter)
{
  mqtt_reply_msg_t reply;

  rt_thread_mdelay(5000);
  rt_kprintf("[mqtt_reply] Reply thread started\n");

  while (1)
  {
    if (rt_mq_recv(g_mqtt_reply_mq, &reply, sizeof(reply), RT_WAITING_FOREVER) != RT_EOK)
      continue;

