Lingjia007/stm32f103c8t6_rtt-nano_znjj/Core/Src/main.c
    if (!g_mqtt_connected)
      continue;

    rt_mutex_take(g_esp8266_mutex, RT_WAITING_FOREVER);
    int16_t ret = MQTT_PUBLISH_SET_REPLY(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                                         ONENET_PRODUCT_ID, ONENET_DEVICE_NAME,
                                         reply.msg_id, 200, "user_succ");
    rt_mutex_release(g_esp8266_mutex);

    if (ret == PLATFORM_MQTT_OK)
      rt_kprintf("[mqtt_reply] Reply OK (id=%s)\n", reply.msg_id);
    else
      rt_kprintf("[mqtt_reply] Reply FAILED (id=%s, err=%d)\n", reply.msg_id, ret);
  }
}

static int mqtt_do_connect(void)
{
  int16_t ret;

  if (!g_mqtt_configured)
  {
    platform_mqtt_user_config_t config;

    memset(&config, 0, sizeof(config));
    strncpy(config.client_id, ONENET_DEVICE_NAME, sizeof(config.client_id) - 1);
    strncpy(config.username, ONENET_PRODUCT_ID, sizeof(config.username) - 1);
    strncpy(config.password, ONENET_MQTT_TOKEN, sizeof(config.password) - 1);

    ret = MQTT_USERCFG(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID, &config);
    if (ret != PLATFORM_MQTT_OK)
    {
      rt_kprintf("MQTT config FAILED! (error=%d)\n", ret);
      return -1;
    }
    g_mqtt_configured = 1;
    rt_kprintf("MQTT configured!\n");
  }
  else
  {
    rt_kprintf("MQTT already configured, reconnecting...\n");
  }

  ret = MQTT_CONNECT(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                     ONENET_MQTT_HOST, ONENET_MQTT_PORT, 1);
  if (ret != PLATFORM_MQTT_OK)
  {
    rt_kprintf("MQTT connect FAILED! resetting config flag\n");
    g_mqtt_configured = 0;
    g_mqtt_connected = 0;
    return -1;
  }

  g_mqtt_connected = 1;
  rt_kprintf("MQTT connected!\n");
  return 0;
}

static void mqtt_do_subscribe(void)
{
  MQTT_SUBSCRIBE(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                 ONENET_TOPIC_PROPERTY_POST_REPLY, 1);
  MQTT_SUBSCRIBE(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                 ONENET_TOPIC_PROPERTY_SET, 1);
  MQTT_SUBSCRIBE(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                 ONENET_TOPIC_PROPERTY_GET, 1);
  MQTT_SUBSCRIBE(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                 ONENET_TOPIC_OTA_INFORM, 1);
  rt_kprintf("MQTT subscribed!\n");
}

static int mqtt_init(void)
{
  int16_t ret;
  char ip_buf[64];
  uint8_t wifi_mode;

  rt_kprintf("Checking MQTT connection...\n");

  if (MQTT_CHECK_CONNECTED(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID) == PLATFORM_MQTT_OK)
  {
    rt_kprintf("MQTT already connected!\n");
    g_mqtt_connected = 1;
    return 0;
  }

  rt_kprintf("MQTT not connected, checking WiFi...\n");

  if (WIFI_AT_TEST(&g_esp8266_wifi.base) != PLATFORM_WIFI_OK)
  {
    rt_kprintf("ESP8266 AT test FAILED!\n");
    return -1;
  }

  ret = WIFI_GET_MODE(&g_esp8266_wifi.base, &wifi_mode);
  if (ret == PLATFORM_WIFI_OK)
  {
    rt_kprintf("WiFi mode: %d (1=STA, 2=AP, 3=STA+AP)\n", wifi_mode);
    if (wifi_mode != PLATFORM_WIFI_MODE_STA)
    {
      rt_kprintf("Setting WiFi to Station mode...\n");
      ret = WIFI_SET_MODE(&g_esp8266_wifi.base, PLATFORM_WIFI_MODE_STA);
      if (ret != PLATFORM_WIFI_OK)
      {
        rt_kprintf("Set Station mode FAILED! (error=%d)\n", ret);
        return -1;
      }
      rt_thread_mdelay(100);
    }
  }

  if (WIFI_GET_IP(&g_esp8266_wifi.base, ip_buf, sizeof(ip_buf)) != PLATFORM_WIFI_OK)
  {
    rt_kprintf("WiFi not connected, connecting...\n");
    ret = WIFI_JOIN_AP(&g_esp8266_wifi.base, ESP8266_WIFI_SSID, ESP8266_WIFI_PASSWORD);
    if (ret != PLATFORM_WIFI_OK)
    {
      rt_kprintf("WiFi connect FAILED! (error=%d)\n", ret);
      return -1;
    }
    rt_kprintf("WiFi connected!\n");
    rt_thread_mdelay(1000);
  }
  else
  {
    rt_kprintf("WiFi already connected (IP: %s)\n", ip_buf);
  }

  rt_kprintf("Connecting MQTT...\n");
  if (mqtt_do_connect() != 0)
  {
    return -1;
  }

  mqtt_do_subscribe();
  return 0;
}

static int mqtt_reconnect(void)
{
  int16_t ret;

  if (g_mqtt_connected)
    return 0;

  rt_mutex_take(g_esp8266_mutex, RT_WAITING_FOREVER);
  ret = mqtt_init();
  rt_mutex_release(g_esp8266_mutex);

  return ret;
}

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_ADC1_Init();
  /* USER CODE BEGIN 2 */
  dwt_init();
  OLED_Init();
  relay_init();
  OLED_Clear();
  OLED_DisplayTurn(0);
  OLED_ColorTurn(0);
  OLED_ShowString(0, 0, (uint8_t *)"Hello RTThread!", 16, 1);
  OLED_Refresh();

  esp8266_platform_init();
  esp8266_uart_enable_it();

  onenet_kv_table_setup();

  g_esp8266_mutex = rt_mutex_create("esp8266", RT_IPC_FLAG_PRIO);
  g_mqtt_frame_sem = rt_sem_create("mq_sem", 0, RT_IPC_FLAG_PRIO);
  g_mqtt_reply_mq = rt_mq_create("mq_rep", sizeof(mqtt_reply_msg_t), 4, RT_IPC_FLAG_PRIO);

  rt_mutex_take(g_esp8266_mutex, RT_WAITING_FOREVER);
  if (mqtt_init() == 0)
  {
    rt_kprintf("MQTT init success!\n");
  }
  else
  {
    rt_kprintf("MQTT init failed!\n");
  }
  rt_mutex_release(g_esp8266_mutex);

  led_thread = rt_thread_create("led",
                                led_thread_entry,
                                RT_NULL,
                                96,
                                24,
                                10);
  if (led_thread != RT_NULL)
    rt_thread_startup(led_thread);

  oled_thread = rt_thread_create("oled",
                                 oled_thread_entry,
                                 RT_NULL,
                                 192,
                                 24,
                                 10);
  if (oled_thread != RT_NULL)
    rt_thread_startup(oled_thread);

  dht11_thread = rt_thread_create("dht11",
                                  dht11_thread_entry,
                                  RT_NULL,
                                  768,
                                  20,
                                  10);
  if (dht11_thread != RT_NULL)
    rt_thread_startup(dht11_thread);

